# PlanarMultiPlanarShapeInSketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..PlanarMultiPlanarShapeInSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PlanarMultiPlanarShapeInSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlanarMultiPlanarShapeInSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PlanarMultiPlanarShapeInSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace